Ran Plan for dir: `aws` workspace: `default`

<details><summary>Show Output</summary>

```diff

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

  # aws_instance.web_app will be created
+ resource "aws_instance" "web_app" {
      + ami                          = "ami-674cbc1e"
      + arn                          = (known after apply)
      + associate_public_ip_address  = (known after apply)
      + availability_zone            = (known after apply)
      + cpu_core_count               = (known after apply)
      + cpu_threads_per_core         = (known after apply)
      + get_password_data            = false
      + host_id                      = (known after apply)
      + id                           = (known after apply)
      + instance_state               = (known after apply)
      + instance_type                = "m5.4xlarge"
      + ipv6_address_count           = (known after apply)
      + ipv6_addresses               = (known after apply)
      + key_name                     = (known after apply)
      + outpost_arn                  = (known after apply)
      + password_data                = (known after apply)
      + placement_group              = (known after apply)
      + primary_network_interface_id = (known after apply)
      + private_dns                  = (known after apply)
      + private_ip                   = (known after apply)
      + public_dns                   = (known after apply)
      + public_ip                    = (known after apply)
      + secondary_private_ips        = (known after apply)
      + security_groups              = (known after apply)
      + source_dest_check            = true
      + subnet_id                    = (known after apply)
      + tenancy                      = (known after apply)
      + vpc_security_group_ids       = (known after apply)

      + ebs_block_device {
          + delete_on_termination = true
          + device_name           = "my_data"
          + encrypted             = (known after apply)
          + iops                  = 800
          + kms_key_id            = (known after apply)
          + snapshot_id           = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = 1000
          + volume_type           = "io1"
        }

      + enclave_options {
          + enabled = (known after apply)
        }

      + ephemeral_block_device {
          + device_name  = (known after apply)
          + no_device    = (known after apply)
          + virtual_name = (known after apply)
        }

      + metadata_options {
          + http_endpoint               = (known after apply)
          + http_put_response_hop_limit = (known after apply)
          + http_tokens                 = (known after apply)
        }

      + network_interface {
          + delete_on_termination = (known after apply)
          + device_index          = (known after apply)
          + network_interface_id  = (known after apply)
        }

      + root_block_device {
          + delete_on_termination = true
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = 50
          + volume_type           = (known after apply)
        }
    }

  # aws_lambda_function.hello_world will be created
+ resource "aws_lambda_function" "hello_world" {
      + arn                            = (known after apply)
      + function_name                  = "hello_world"
      + handler                        = "exports.test"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 1024
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = "arn:aws:lambda:us-east-1:account-id:resource-id"
      + runtime                        = "nodejs12.x"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + source_code_hash               = (known after apply)
      + source_code_size               = (known after apply)
      + timeout                        = 3
      + version                        = (known after apply)

      + tracing_config {
          + mode = (known after apply)
        }
    }

Plan: 2 to add, 0 to change, 0 to destroy.

[K  ⠋ Running terraform show WWWWWWWWWWWWWWWWWWWWWWWWWWWW[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K  ⠙ Running terraform show WWWWWWWWWWWWWWWWWWWWWWWWWWWW[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K  ⠹ Running terraform show WWWWWWWWWWWWWWWWWWWWWWWWWWWW[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K  ⠸ Running terraform show WWWWWWWWWWWWWWWWWWWWWWWWWWWW[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K  ⠼ Running terraform show WWWWWWWWWWWWWWWWWWWWWWWWWWWW[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K  ⠴ Running terraform show WWWWWWWWWWWWWWWWWWWWWWWWWWWW[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K  ⠦ Running terraform show WWWWWWWWWWWWWWWWWWWWWWWWWWWW[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K  ⠧ Running terraform show WWWWWWWWWWWWWWWWWWWWWWWWWWWW[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K  ⠇ Running terraform show WWWWWWWWWWWWWWWWWWWWWWWWWWWW[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K  ⠏ Running terraform show WWWWWWWWWWWWWWWWWWWWWWWWWWWW[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K  ⠋ Running terraform show WWWWWWWWWWWWWWWWWWWWWWWWWWWW[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K  ✔ Running terraform show
[K  ⠋ Calculating cost estimate WWWWWWWWWWWWWWWWWWWWWWWWWWWWWWW[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K  ⠙ Calculating cost estimate WWWWWWWWWWWWWWWWWWWWWWWWWWWWWWW[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K  ⠹ Calculating cost estimate WWWWWWWWWWWWWWWWWWWWWWWWWWWWWWW[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K  ⠸ Calculating cost estimate WWWWWWWWWWWWWWWWWWWWWWWWWWWWWWW[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K  ⠼ Calculating cost estimate WWWWWWWWWWWWWWWWWWWWWWWWWWWWWWW[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K  ⠴ Calculating cost estimate WWWWWWWWWWWWWWWWWWWWWWWWWWWWWWW[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K  ⠦ Calculating cost estimate WWWWWWWWWWWWWWWWWWWWWWWWWWWWWWW[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K  ✔ Calculating cost estimate

  NAME                                         MONTHLY QTY  UNIT         PRICE   HOURLY COST  MONTHLY COST  

  aws_instance.web_app                                                                                      
  ├─ Linux/UNIX usage (on-demand, m5.4xlarge)          730  hours        0.7680       0.7680      560.6400  
  ├─ root_block_device                         
  │  └─ General Purpose SSD storage (gp2)               50  GB-months    0.1000       0.0068        5.0000  
  └─ ebs_block_device[0]                       
     ├─ Provisioned IOPS SSD storage (io1)           1,000  GB-months    0.1250       0.1712      125.0000  
     └─ Provisioned IOPS                               800  IOPS-months  0.0650       0.0712       52.0000  
  Total                                                                               1.0173      742.6400  
                                                                                                            
  aws_lambda_function.hello_world                                                                           
  ├─ Requests                                            -  1M requests  0.2000            -             -  
  └─ Duration                                            -  GB-seconds    2e-05            -             -  
  Total                                                                                    -             -  
                                                                                                            
  OVERALL TOTAL (USD)                                                                 1.0173      742.6400  


```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d aws`
* :put_litter_in_its_place: To **delete** this plan click [here](http://a132a015d99c:4141/lock?id=infracost%252Fatlantis-demo%252Faws%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d aws`
</details>

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To delete all plans and locks for the PR, comment:
    * `atlantis unlock`
